src/DataProcessors/ПомощникИсправленияОстатковТоваровОрганизаций/ПомощникИсправленияОстатковТоваровОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникИсправленияОстатковТоваровОрганизаций</name>
</mdclass:DataProcessor>

src/AccumulationRegisters/ТоварыОрганизаций/ТоварыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыОрганизаций</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КорВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияОтгрузки</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРеализации</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Первичное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НоменклатураГТД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/DataProcessors/ПомощникИсправленияОстатковТоваровОрганизаций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ТекстЗапросаСостояниеОстатковТоваровОрганизаций() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТоварыОрганизаций.Организация КАК Организация,
	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТоварыОрганизаций.Период КАК Период
	|
	|ПОМЕСТИТЬ ВтТаблицаОтрицательныхОстатков
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Месяц,,) КАК ТоварыОрганизаций
	|ГДЕ
	|	ТоварыОрганизаций.КоличествоКонечныйОстаток < 0
	|	И ТоварыОрганизаций.КоличествоНачальныйОстаток <> ТоварыОрганизаций.КоличествоКонечныйОстаток
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	АналитикаУчетаНоменклатуры,
	|	Период
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТоварыОрганизаций.Период КАК Период
	|
	|ПОМЕСТИТЬ ВтТаблицаОтсутствующихТоваров
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Месяц,,) КАК ТоварыОрганизаций
	|ГДЕ
	|	ТоварыОрганизаций.КоличествоКонечныйОстаток < 0
	|	И ТоварыОрганизаций.КоличествоНачальныйОстаток <> ТоварыОрганизаций.КоличествоКонечныйОстаток
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	Период
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|// ОТРИЦАТЕЛЬНЫЕ ОСТАТКИ ТОВАРОВ ОРГАНИЗАЦИЙ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОтрицательныхОстатков.Период КАК Период
	|ИЗ
	|	ВтТаблицаОтрицательныхОстатков КАК ТаблицаОтрицательныхОстатков
	|ГДЕ
	|	ТаблицаОтрицательныхОстатков.Организация В (&МассивОрганизаций)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период ВОЗР
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|// РАЗВЕРНУТОЕ САЛЬДО ПО ТОВАРАМ ОРГАНИЗАЦИЙ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыОрганизаций.Период КАК Период
	|ИЗ (
	|	ВЫБРАТЬ
	|		ТоварыОрганизаций.Организация КАК Организация,
	|		ТоварыОрганизаций.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ТоварыОрганизаций.ВидЗапасов КАК ВидЗапасов,
	|		ТоварыОрганизаций.НомерГТД КАК НомерГТД,
	|		ТоварыОрганизаций.Период
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизаций.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Месяц,, 
	|			Организация В (&МассивОрганизаций)
	|		) КАК ТоварыОрганизаций
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтТаблицаОтрицательныхОстатков КАК ТаблицаОтрицательныхОстатков
	|		ПО
	|			ТоварыОрганизаций.Организация = ТаблицаОтрицательныхОстатков.Организация
	|			И ТоварыОрганизаций.АналитикаУчетаНоменклатуры = ТаблицаОтрицательныхОстатков.АналитикаУчетаНоменклатуры
	|			И ТоварыОрганизаций.Период = ТаблицаОтрицательныхОстатков.Период
	|	ГДЕ
	|		ТоварыОрганизаций.КоличествоКонечныйОстаток < 0
	|		И ТоварыОрганизаций.КоличествоНачальныйОстаток <> ТоварыОрганизаций.КоличествоКонечныйОстаток
	|		И ТаблицаОтрицательныхОстатков.Период ЕСТЬ NULL
	|		
	|	) КАК ТоварыОрганизаций
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период ВОЗР
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|// НЕДОСТАТОЧНО ТОВАРОВ ОРГАНИЗАЦИЙ НА СКЛАДАХ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОтсутствующихТоваров.Период КАК Период
	|ИЗ
	|	ВтТаблицаОтсутствующихТоваров КАК ТаблицаОтсутствующихТоваров
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период ВОЗР
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|// МОЖНО ОФОРМИТЬ ПЕРЕДАЧИ ТОВАРОВ МЕЖДУ ОРГАНИЗАЦИЯМИ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыОрганизаций.Период КАК Период
	|ИЗ (
	|	ВЫБРАТЬ
	|		ТаблицаОтрицательныхОстатков.Организация КАК Организация,
	|		ТаблицаОтрицательныхОстатков.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ТаблицаОтрицательныхОстатков.Период КАК Период
	|	ИЗ
	|		ВтТаблицаОтрицательныхОстатков КАК ТаблицаОтрицательныхОстатков
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ВтТаблицаОтсутствующихТоваров КАК ТаблицаОтсутствующихТоваров
	|		ПО
	|			ТаблицаОтрицательныхОстатков.АналитикаУчетаНоменклатуры = ТаблицаОтсутствующихТоваров.АналитикаУчетаНоменклатуры
	|			И ТаблицаОтрицательныхОстатков.Период = ТаблицаОтсутствующихТоваров.Период
	|	ГДЕ
	|		ТаблицаОтсутствующихТоваров.Период ЕСТЬ NULL
	|		И ТаблицаОтрицательныхОстатков.Организация В (&МассивОрганизаций)
	|
	|	) КАК ТоварыОрганизаций
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период ВОЗР
	|;
	|/////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ТекстЗапроса;

#КонецОбласти
КонецФункции
#КонецЕсли
